app/Controllers/Classes.php

DELETE FROM `Classes`
WHERE `classId` = '79'
AND `classId` IN ('79')
---
    public function classDelete($classId = null)
    {
        $model = new classModel();
        $data['classes'] = $model->where('classId', $classId)->delete($classId);